import pandas as pd
import numpy as np
import streamlit as st
import requests
from io import StringIO
import plotly.graph_objects as go
import plotly.express as px

# API呼び出しの結果を格納するためのセッションステートの初期化
if 'api_result' not in st.session_state:
    st.session_state.api_result = None

# Streamlitのタイトル
st.sidebar.title('テキスト感情分析（モデル未使用）')

# 見本用のテキスト
selected_item = st.sidebar.selectbox('サンプルテキスト', 
    [
    '',
    'サンプルテキスト',
    '商品レビュー',
    'トラブル',
    '吾輩は猫である', 
    '草枕', 
    'ポラーノの広場'
    ],
    help='リストからサンプルテキストを選択できます')

aozora_dict = {
    'サンプルテキスト':"サンプルテキストです。雨が降って気分がどんより。こんな時こそ笑顔が一番！空が晴れたら虹もかかった。素晴らしい一日になりました。",
    '商品レビュー':"このリップクリーム、すっごく良かったです！　唇がプルプルになりました！使用感も軽やかで、塗り心地は本当に滑らか。色持ちも良くて、朝塗れば夕方までしっかり色が残っているんです。それに、このリップクリームの香り！ほんのり甘くて、つけているだけで気分が上がります。包装もシンプルでエレガント、持ち歩くのが嬉しくなるデザイン。でも、ちょっと高すぎ。確かに品質はいいけど、他のブランドのリップクリームと比較すると、かなり高価。毎日使うものと考えると少し手が出しづらい価格設定かもしれません。あと、種類が豊富すぎて選びづらいという問題も。どれが自分に合っているのか迷ってしまいます。それでも、このリップクリームは最近の一押しです。まだ買ったことのない人は一度試してみることをオススメします。",
    'トラブル':"看板にソフトクリーム屋とあるのに、アイスが全くないのはちょっと驚きました。正直、期待していた分、がっかりはしましたね。でも、店員さんも困っている様子で、マシンが壊れてしまったらしい。そういうアクシデントはどこにでもあることだし、仕方ないのかなとも思います。ただ、せめて入店前に何らかの告知があれば、もう少し気持ちの整理もついたかもしれません。店員さんの対応は、状況を踏まえれば、まぁ頑張っていた方かなと。今回は満足いく体験ではなかったですが、修理が済んだら、また改めて足を運んでみようかな、とは思います。次こそは、期待に応えてくれるといいなと期待しています。",
    '吾輩は猫である':"吾輩は猫である。名前はまだ無い。どこで生れたかとんと見当がつかぬ。何でも薄暗いじめじめした所でニャーニャー泣いていた事だけは記憶している。吾輩はここで始めて人間というものを見た。しかもあとで聞くとそれは書生という人間中で一番獰悪な種族であったそうだ。この書生というのは時々我々を捕えて煮て食うという話である。", 
    '草枕':"山路を登りながら、こう考えた。智に働けば角が立つ。情に棹させば流される。意地を通せば窮屈だ。とかくに人の世は住みにくい。住みにくさが高じると、安い所へ引き越したくなる。どこへ越しても住みにくいと悟った時、詩が生れて、画が出来る。", 
    'ポラーノの広場':"そのころわたくしは、モリーオ市の博物局に勤めて居りました。十八等官でしたから役所のなかでも、ずうっと下の方でしたし俸給もほんのわずかでしたが、受持ちが標本の採集や整理で生れ付き好きなことでしたから、わたくしは毎日ずいぶん愉快にはたらきました。殊にそのころ、モリーオ市では競馬場を植物園に拵こしらえ直すというので、その景色のいいまわりにアカシヤを植え込んだ広い地面が、切符売場や信号所の建物のついたまま、わたくしどもの役所の方へまわって来たものですから、わたくしはすぐ宿直という名前で月賦で買った小さな蓄音器と二十枚ばかりのレコードをもって、その番小屋にひとり住むことになりました。わたくしはそこの馬を置く場所に板で小さなしきいをつけて一疋の山羊を飼いました。毎朝その乳をしぼってつめたいパンをひたしてたべ、それから黒い革のかばんへすこしの書類や雑誌を入れ、靴もきれいにみがき、並木のポプラの影法師を大股にわたって市の役所へ出て行くのでした。あのイーハトーヴォのすきとおった風、夏でも底に冷たさをもつ青いそら、うつくしい森で飾られたモリーオ市、郊外のぎらぎらひかる草の波。"
    }

sample_text = "リストから選択してください"
if selected_item in aozora_dict:
    sample_text = aozora_dict[selected_item]

# ユーザー入力用のテキストエリア→サンプルは文字表示のみに変更
st.sidebar.text("テキスト内容")
container = st.sidebar.container(border=True)
container.write(str(sample_text)[:100] + "…" if len(sample_text)>100 else sample_text)

# 感情リスト
emotion_list = ['喜び', '期待', '驚き', '恐れ', '悲しみ', '怒り']

# ポジティブ度の説明文dict
mentality_descriptions = {
    1 : "全面的に悲観的です。",
    2 : "否定的であり、悲観的な見方が強く出ています。",
    3 : "ほぼ否定的で、楽観的要素が少ないです。",
    4 : "悲観的な見方がありつつ、少し希望が見えます。",
    5 : "中立的な立場を保っている文章です。",
    6 : "ポジティブな見方が感じられます。",
    7 : "明るく希望的な内容が含まれています。",
    8 : "非常にポジティブな視点を持っています。",
    9 : "極めて前向きで、明るい内容です。"
}

# テンション度の説明文dict
tension_descriptions = {
    1 : "動きがなく、完全に静かな状態です。",
    2 : "非常に落ち着いており、感情の起伏がありません。",
    3 : "やや低めのテンションで、感情の起伏は穏やかです。",
    4 : "穏やかな動きで、落ち着いた雰囲気です。",
    5 : "普通の活動レベルで、バランスが取れています。",
    6 : "やや活発で、エネルギーが感じられます。",
    7 : "活発でエネルギッシュな様子が伝わります。",
    8 : "非常に高いテンションで、活動的です。",
    9 : "極めてエネルギッシュで、興奮しています。"
}


@st.cache_data()
def to_dataframe(api_json):
    # データフレームに変換
    df = pd.DataFrame(api_json)
    
    # 感情リストを展開
    for index, row in df.iterrows():
        for emotion, score in row['scores'].items():
            df.at[index, emotion] = score
    df = df.drop(labels=['scores'],axis=1)
    
    # 感情カテゴリ
    positive = ['喜び', '期待']
    negative = ['悲しみ', '怒り']
    natural_positive = ['驚き']
    natural_negative = ['恐れ']

    # ポジティブかネガティブかで重さを計算する関数
    def calculate_sentiment_score(row):
        score = 0.5
        for emotion in positive:
            score += row.get(emotion, 0)
        for emotion in negative:
            score -= row.get(emotion, 0)
        for emotion in natural_positive:
            score += row.get(emotion, 0) / 2
        for emotion in natural_negative:
            score -= row.get(emotion, 0) / 2
        return score
    
    # 感情スコアの重みを計算して正則化
    weighted = df[emotion_list].apply(calculate_sentiment_score, axis=1)*2
    normalized_scores = (weighted - weighted.min()) / (weighted.max() - weighted.min())
    
    # dfに重み付きスコア（ポジティブ度)を追加
    df.insert(len(df.columns)-len(emotion_list),'normalized_scores',normalized_scores)
    
    # 重み付きスコアが0.3以下かつ最大感情がpositiveのとき、0.5にする
    # （全てが満遍なく低いとき、positiveでも重み付きスコアが低くなるため）
    df.loc[(df['normalized_scores'] < 0.3) & (df['max_label'].isin(positive)), 'normalized_scores'] = 0.5
    
    # indexを1行目から
    df.index = df.index + 1
    
    return df


# ボタンウィジェット
if st.sidebar.button("分析開始"):
    
    # サンプルアプリなのでデータを直接渡す
    sampletext_dict = {
    'サンプルテキスト':[{"sentence": "\u30b5\u30f3\u30d7\u30eb\u30c6\u30ad\u30b9\u30c8\u3067\u3059\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.48843586444854736, "scores": {"\u559c\u3073": 0.39598625898361206, "\u60b2\u3057\u307f": 0.03639533370733261, "\u671f\u5f85": 0.48843586444854736, "\u9a5a\u304d": 0.059582799673080444, "\u6012\u308a": 0.004175560548901558, "\u6050\u308c": 0.015424195677042007}}, {"sentence": "\u96e8\u304c\u964d\u3063\u3066\u6c17\u5206\u304c\u3069\u3093\u3088\u308a\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.9151480197906494, "scores": {"\u559c\u3073": 0.022677678614854813, "\u60b2\u3057\u307f": 0.9151480197906494, "\u671f\u5f85": 0.0082939388230443, "\u9a5a\u304d": 0.01270879153162241, "\u6012\u308a": 0.0017640928272157907, "\u6050\u308c": 0.03940749540925026}}, {"sentence": "\u3053\u3093\u306a\u6642\u3053\u305d\u7b11\u9854\u304c\u4e00\u756a\uff01", "sentiment": 2, "max_label": "\u559c\u3073", "max_score": 0.5494150519371033, "scores": {"\u559c\u3073": 0.5494150519371033, "\u60b2\u3057\u307f": 0.005367650650441647, "\u671f\u5f85": 0.40476253628730774, "\u9a5a\u304d": 0.03391158580780029, "\u6012\u308a": 0.002008158015087247, "\u6050\u308c": 0.004535002168267965}}, {"sentence": "\u7a7a\u304c\u6674\u308c\u305f\u3089\u8679\u3082\u304b\u304b\u3063\u305f\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.7057519555091858, "scores": {"\u559c\u3073": 0.06644785404205322, "\u60b2\u3057\u307f": 0.05666795372962952, "\u671f\u5f85": 0.020981663838028908, "\u9a5a\u304d": 0.7057519555091858, "\u6012\u308a": 0.00437396764755249, "\u6050\u308c": 0.14577658474445343}}, {"sentence": "\u7d20\u6674\u3089\u3057\u3044\u4e00\u65e5\u306b\u306a\u308a\u307e\u3057\u305f\u3002", "sentiment": 2, "max_label": "\u559c\u3073", "max_score": 0.9873785376548767, "scores": {"\u559c\u3073": 0.9873785376548767, "\u60b2\u3057\u307f": 0.0012692223535850644, "\u671f\u5f85": 0.0039941053837537766, "\u9a5a\u304d": 0.005985229276120663, "\u6012\u308a": 0.0004538037464953959, "\u6050\u308c": 0.0009191293502226472}}],
    '商品レビュー':[{"sentence": "\u3053\u306e\u30ea\u30c3\u30d7\u30af\u30ea\u30fc\u30e0\u3001\u3059\u3063\u3054\u304f\u826f\u304b\u3063\u305f\u3067\u3059\uff01", "sentiment": 2, "max_label": "\u559c\u3073", "max_score": 0.9780837297439575, "scores": {"\u559c\u3073": 0.9780837297439575, "\u60b2\u3057\u307f": 0.0014321322087198496, "\u671f\u5f85": 0.004002510104328394, "\u9a5a\u304d": 0.014723059721291065, "\u6012\u308a": 0.0005747434915974736, "\u6050\u308c": 0.0011837717611342669}}, {"sentence": "\u5507\u304c\u30d7\u30eb\u30d7\u30eb\u306b\u306a\u308a\u307e\u3057\u305f\uff01", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.7554274201393127, "scores": {"\u559c\u3073": 0.7554274201393127, "\u60b2\u3057\u307f": 0.00831449031829834, "\u671f\u5f85": 0.030619962140917778, "\u9a5a\u304d": 0.19843871891498566, "\u6012\u308a": 0.0015387495514005423, "\u6050\u308c": 0.0056606135331094265}}, {"sentence": "\u4f7f\u7528\u611f\u3082\u8efd\u3084\u304b\u3067\u3001\u5857\u308a\u5fc3\u5730\u306f\u672c\u5f53\u306b\u6ed1\u3089\u304b\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.9502794742584229, "scores": {"\u559c\u3073": 0.9502794742584229, "\u60b2\u3057\u307f": 0.0026831459254026413, "\u671f\u5f85": 0.0055827973410487175, "\u9a5a\u304d": 0.03769407793879509, "\u6012\u308a": 0.0007538774516433477, "\u6050\u308c": 0.0030067083425819874}}, {"sentence": "\u8272\u6301\u3061\u3082\u826f\u304f\u3066\u3001\u671d\u5857\u308c\u3070\u5915\u65b9\u307e\u3067\u3057\u3063\u304b\u308a\u8272\u304c\u6b8b\u3063\u3066\u3044\u308b\u3093\u3067\u3059\u3002", "sentiment": 1, "max_label": "\u9a5a\u304d", "max_score": 0.5048707127571106, "scores": {"\u559c\u3073": 0.28247684240341187, "\u60b2\u3057\u307f": 0.07245156168937683, "\u671f\u5f85": 0.07051699608564377, "\u9a5a\u304d": 0.5048707127571106, "\u6012\u308a": 0.0059386976063251495, "\u6050\u308c": 0.0637451708316803}}, {"sentence": "\u305d\u308c\u306b\u3001\u3053\u306e\u30ea\u30c3\u30d7\u30af\u30ea\u30fc\u30e0\u306e\u9999\u308a\uff01", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.7882754802703857, "scores": {"\u559c\u3073": 0.7882754802703857, "\u60b2\u3057\u307f": 0.004302754066884518, "\u671f\u5f85": 0.09387087821960449, "\u9a5a\u304d": 0.10663793236017227, "\u6012\u308a": 0.0020580736454576254, "\u6050\u308c": 0.004854765720665455}}, {"sentence": "\u307b\u3093\u306e\u308a\u7518\u304f\u3066\u3001\u3064\u3051\u3066\u3044\u308b\u3060\u3051\u3067\u6c17\u5206\u304c\u4e0a\u304c\u308a\u307e\u3059\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.9493897557258606, "scores": {"\u559c\u3073": 0.9493897557258606, "\u60b2\u3057\u307f": 0.005056184716522694, "\u671f\u5f85": 0.031930260360240936, "\u9a5a\u304d": 0.01039968989789486, "\u6012\u308a": 0.0007003956707194448, "\u6050\u308c": 0.002523828065022826}}, {"sentence": "\u5305\u88c5\u3082\u30b7\u30f3\u30d7\u30eb\u3067\u30a8\u30ec\u30ac\u30f3\u30c8\u3001\u6301\u3061\u6b69\u304f\u306e\u304c\u5b09\u3057\u304f\u306a\u308b\u30c7\u30b6\u30a4\u30f3\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.93508380651474, "scores": {"\u559c\u3073": 0.93508380651474, "\u60b2\u3057\u307f": 0.0030093330424278975, "\u671f\u5f85": 0.04871705546975136, "\u9a5a\u304d": 0.010412890464067459, "\u6012\u308a": 0.0007902568904682994, "\u6050\u308c": 0.001986628631129861}}, {"sentence": "\u3067\u3082\u3001\u3061\u3087\u3063\u3068\u9ad8\u3059\u304e\u3002", "sentiment": -1, "max_label": "\u9a5a\u304d", "max_score": 0.4908102750778198, "scores": {"\u559c\u3073": 0.01999541185796261, "\u60b2\u3057\u307f": 0.1013106256723404, "\u671f\u5f85": 0.008584500290453434, "\u9a5a\u304d": 0.4908102750778198, "\u6012\u308a": 0.005679961293935776, "\u6050\u308c": 0.3736192286014557}}, {"sentence": "\u78ba\u304b\u306b\u54c1\u8cea\u306f\u3044\u3044\u3051\u3069\u3001\u4ed6\u306e\u30d6\u30e9\u30f3\u30c9\u306e\u30ea\u30c3\u30d7\u30af\u30ea\u30fc\u30e0\u3068\u6bd4\u8f03\u3059\u308b\u3068\u3001\u304b\u306a\u308a\u9ad8\u4fa1\u3002", "sentiment": -1, "max_label": "\u9a5a\u304d", "max_score": 0.5389971137046814, "scores": {"\u559c\u3073": 0.04956463724374771, "\u60b2\u3057\u307f": 0.22084727883338928, "\u671f\u5f85": 0.011548195034265518, "\u9a5a\u304d": 0.5389971137046814, "\u6012\u308a": 0.011735529638826847, "\u6050\u308c": 0.16730721294879913}}, {"sentence": "\u6bce\u65e5\u4f7f\u3046\u3082\u306e\u3068\u8003\u3048\u308b\u3068\u5c11\u3057\u624b\u304c\u51fa\u3057\u3065\u3089\u3044\u4fa1\u683c\u8a2d\u5b9a\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002", "sentiment": -1, "max_label": "\u6050\u308c", "max_score": 0.4916384816169739, "scores": {"\u559c\u3073": 0.01783919148147106, "\u60b2\u3057\u307f": 0.3697492778301239, "\u671f\u5f85": 0.05058599263429642, "\u9a5a\u304d": 0.04164255037903786, "\u6012\u308a": 0.028544502332806587, "\u6050\u308c": 0.4916384816169739}}, {"sentence": "\u3042\u3068\u3001\u7a2e\u985e\u304c\u8c4a\u5bcc\u3059\u304e\u3066\u9078\u3073\u3065\u3089\u3044\u3068\u3044\u3046\u554f\u984c\u3082\u3002", "sentiment": -1, "max_label": "\u6050\u308c", "max_score": 0.643369197845459, "scores": {"\u559c\u3073": 0.00756644643843174, "\u60b2\u3057\u307f": 0.29252758622169495, "\u671f\u5f85": 0.028511036187410355, "\u9a5a\u304d": 0.01839039847254753, "\u6012\u308a": 0.00963530782610178, "\u6050\u308c": 0.643369197845459}}, {"sentence": "\u3069\u308c\u304c\u81ea\u5206\u306b\u5408\u3063\u3066\u3044\u308b\u306e\u304b\u8ff7\u3063\u3066\u3057\u307e\u3044\u307e\u3059\u3002", "sentiment": 0, "max_label": "\u60b2\u3057\u307f", "max_score": 0.6446382999420166, "scores": {"\u559c\u3073": 0.006605863105505705, "\u60b2\u3057\u307f": 0.6446382999420166, "\u671f\u5f85": 0.01680508628487587, "\u9a5a\u304d": 0.019987307488918304, "\u6012\u308a": 0.005792835261672735, "\u6050\u308c": 0.3061707317829132}}, {"sentence": "\u305d\u308c\u3067\u3082\u3001\u3053\u306e\u30ea\u30c3\u30d7\u30af\u30ea\u30fc\u30e0\u306f\u6700\u8fd1\u306e\u4e00\u62bc\u3057\u3067\u3059\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.6556514501571655, "scores": {"\u559c\u3073": 0.2400003969669342, "\u60b2\u3057\u307f": 0.011020885780453682, "\u671f\u5f85": 0.0748719647526741, "\u9a5a\u304d": 0.6556514501571655, "\u6012\u308a": 0.003804095322266221, "\u6050\u308c": 0.014651205390691757}}, {"sentence": "\u307e\u3060\u8cb7\u3063\u305f\u3053\u3068\u306e\u306a\u3044\u4eba\u306f\u4e00\u5ea6\u8a66\u3057\u3066\u307f\u308b\u3053\u3068\u3092\u30aa\u30b9\u30b9\u30e1\u3057\u307e\u3059\u3002", "sentiment": 1, "max_label": "\u671f\u5f85", "max_score": 0.9758620262145996, "scores": {"\u559c\u3073": 0.012324705719947815, "\u60b2\u3057\u307f": 0.005780932027846575, "\u671f\u5f85": 0.9758620262145996, "\u9a5a\u304d": 0.0012243728851899505, "\u6012\u308a": 0.00119745172560215, "\u6050\u308c": 0.003610507119446993}}],
    'トラブル':[{"sentence": "\u770b\u677f\u306b\u30bd\u30d5\u30c8\u30af\u30ea\u30fc\u30e0\u5c4b\u3068\u3042\u308b\u306e\u306b\u3001\u30a2\u30a4\u30b9\u304c\u5168\u304f\u306a\u3044\u306e\u306f\u3061\u3087\u3063\u3068\u9a5a\u304d\u307e\u3057\u305f\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.9590908288955688, "scores": {"\u559c\u3073": 0.01962641440331936, "\u60b2\u3057\u307f": 0.0037906672805547714, "\u671f\u5f85": 0.0033775134943425655, "\u9a5a\u304d": 0.9590908288955688, "\u6012\u308a": 0.002481012837961316, "\u6050\u308c": 0.011633533053100109}}, {"sentence": "\u6b63\u76f4\u3001\u671f\u5f85\u3057\u3066\u3044\u305f\u5206\u3001\u304c\u3063\u304b\u308a\u306f\u3057\u307e\u3057\u305f\u306d\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.9351010918617249, "scores": {"\u559c\u3073": 0.0137788699939847, "\u60b2\u3057\u307f": 0.9351010918617249, "\u671f\u5f85": 0.0044038002379238605, "\u9a5a\u304d": 0.017426984384655952, "\u6012\u308a": 0.0026172809302806854, "\u6050\u308c": 0.02667202614247799}}, {"sentence": "\u3067\u3082\u3001\u5e97\u54e1\u3055\u3093\u3082\u56f0\u3063\u3066\u3044\u308b\u69d8\u5b50\u3067\u3001\u30de\u30b7\u30f3\u304c\u58ca\u308c\u3066\u3057\u307e\u3063\u305f\u3089\u3057\u3044\u3002", "sentiment": -1, "max_label": "\u6050\u308c", "max_score": 0.41982394456863403, "scores": {"\u559c\u3073": 0.014586687088012695, "\u60b2\u3057\u307f": 0.1942369043827057, "\u671f\u5f85": 0.004693552851676941, "\u9a5a\u304d": 0.3581521809101105, "\u6012\u308a": 0.008506730198860168, "\u6050\u308c": 0.41982394456863403}}, {"sentence": "\u305d\u3046\u3044\u3046\u30a2\u30af\u30b7\u30c7\u30f3\u30c8\u306f\u3069\u3053\u306b\u3067\u3082\u3042\u308b\u3053\u3068\u3060\u3057\u3001\u4ed5\u65b9\u306a\u3044\u306e\u304b\u306a\u3068\u3082\u601d\u3044\u307e\u3059\u3002", "sentiment": 0, "max_label": "\u6050\u308c", "max_score": 0.7047774195671082, "scores": {"\u559c\u3073": 0.00679087545722723, "\u60b2\u3057\u307f": 0.20432275533676147, "\u671f\u5f85": 0.04690491035580635, "\u9a5a\u304d": 0.02392779104411602, "\u6012\u308a": 0.013276183977723122, "\u6050\u308c": 0.7047774195671082}}, {"sentence": "\u305f\u3060\u3001\u305b\u3081\u3066\u5165\u5e97\u524d\u306b\u4f55\u3089\u304b\u306e\u544a\u77e5\u304c\u3042\u308c\u3070\u3001\u3082\u3046\u5c11\u3057\u6c17\u6301\u3061\u306e\u6574\u7406\u3082\u3064\u3044\u305f\u304b\u3082\u3057\u308c\u307e\u305b\u3093\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.5373755097389221, "scores": {"\u559c\u3073": 0.015491308644413948, "\u60b2\u3057\u307f": 0.5373755097389221, "\u671f\u5f85": 0.032628707587718964, "\u9a5a\u304d": 0.031059084460139275, "\u6012\u308a": 0.012158224359154701, "\u6050\u308c": 0.37128716707229614}}, {"sentence": "\u5e97\u54e1\u3055\u3093\u306e\u5bfe\u5fdc\u306f\u3001\u72b6\u6cc1\u3092\u8e0f\u307e\u3048\u308c\u3070\u3001\u307e\u3041\u9811\u5f35\u3063\u3066\u3044\u305f\u65b9\u304b\u306a\u3068\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.9478541612625122, "scores": {"\u559c\u3073": 0.02291199378669262, "\u60b2\u3057\u307f": 0.009101765230298042, "\u671f\u5f85": 0.9478541612625122, "\u9a5a\u304d": 0.006052547600120306, "\u6012\u308a": 0.0020390741992741823, "\u6050\u308c": 0.01204030029475689}}, {"sentence": "\u4eca\u56de\u306f\u6e80\u8db3\u3044\u304f\u4f53\u9a13\u3067\u306f\u306a\u304b\u3063\u305f\u3067\u3059\u304c\u3001\u4fee\u7406\u304c\u6e08\u3093\u3060\u3089\u3001\u307e\u305f\u6539\u3081\u3066\u8db3\u3092\u904b\u3093\u3067\u307f\u3088\u3046\u304b\u306a\u3001\u3068\u306f\u601d\u3044\u307e\u3059\u3002", "sentiment": 1, "max_label": "\u671f\u5f85", "max_score": 0.9488708972930908, "scores": {"\u559c\u3073": 0.03389410674571991, "\u60b2\u3057\u307f": 0.008519652299582958, "\u671f\u5f85": 0.9488708972930908, "\u9a5a\u304d": 0.0024193779099732637, "\u6012\u308a": 0.0010972915915772319, "\u6050\u308c": 0.005198682192713022}}, {"sentence": "\u6b21\u3053\u305d\u306f\u3001\u671f\u5f85\u306b\u5fdc\u3048\u3066\u304f\u308c\u308b\u3068\u3044\u3044\u306a\u3068\u671f\u5f85\u3057\u3066\u3044\u307e\u3059\u3002", "sentiment": 1, "max_label": "\u671f\u5f85", "max_score": 0.9763118028640747, "scores": {"\u559c\u3073": 0.014229130931198597, "\u60b2\u3057\u307f": 0.0035266370978206396, "\u671f\u5f85": 0.9763118028640747, "\u9a5a\u304d": 0.0015898009296506643, "\u6012\u308a": 0.00098661077208817, "\u6050\u308c": 0.003356000641360879}}],
    '吾輩は猫である':[{"sentence": "\u543e\u8f29\u306f\u732b\u3067\u3042\u308b\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.500098466873169, "scores": {"\u559c\u3073": 0.1183171197772026, "\u60b2\u3057\u307f": 0.14194893836975098, "\u671f\u5f85": 0.03609951213002205, "\u9a5a\u304d": 0.500098466873169, "\u6012\u308a": 0.017325254157185555, "\u6050\u308c": 0.1862107217311859}}, {"sentence": "\u540d\u524d\u306f\u307e\u3060\u7121\u3044\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.8364328742027283, "scores": {"\u559c\u3073": 0.009431210346519947, "\u60b2\u3057\u307f": 0.8364328742027283, "\u671f\u5f85": 0.006569895893335342, "\u9a5a\u304d": 0.08270280063152313, "\u6012\u308a": 0.007193239871412516, "\u6050\u308c": 0.05767003446817398}}, {"sentence": "\u3069\u3053\u3067\u751f\u308c\u305f\u304b\u3068\u3093\u3068\u898b\u5f53\u304c\u3064\u304b\u306c\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.5692834854125977, "scores": {"\u559c\u3073": 0.010297439061105251, "\u60b2\u3057\u307f": 0.5692834854125977, "\u671f\u5f85": 0.007795438636094332, "\u9a5a\u304d": 0.126305490732193, "\u6012\u308a": 0.013049825094640255, "\u6050\u308c": 0.27326834201812744}}, {"sentence": "\u4f55\u3067\u3082\u8584\u6697\u3044\u3058\u3081\u3058\u3081\u3057\u305f\u6240\u3067\u30cb\u30e3\u30fc\u30cb\u30e3\u30fc\u6ce3\u3044\u3066\u3044\u305f\u4e8b\u3060\u3051\u306f\u8a18\u61b6\u3057\u3066\u3044\u308b\u3002", "sentiment": 0, "max_label": "\u60b2\u3057\u307f", "max_score": 0.7862425446510315, "scores": {"\u559c\u3073": 0.054147519171237946, "\u60b2\u3057\u307f": 0.7862425446510315, "\u671f\u5f85": 0.013078182004392147, "\u9a5a\u304d": 0.07027672976255417, "\u6012\u308a": 0.004826131742447615, "\u6050\u308c": 0.07142883539199829}}, {"sentence": "\u543e\u8f29\u306f\u3053\u3053\u3067\u59cb\u3081\u3066\u4eba\u9593\u3068\u3044\u3046\u3082\u306e\u3092\u898b\u305f\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.7742056250572205, "scores": {"\u559c\u3073": 0.14898303151130676, "\u60b2\u3057\u307f": 0.011320899240672588, "\u671f\u5f85": 0.042390577495098114, "\u9a5a\u304d": 0.7742056250572205, "\u6012\u308a": 0.0025045431684702635, "\u6050\u308c": 0.020595377311110497}}, {"sentence": "\u3057\u304b\u3082\u3042\u3068\u3067\u805e\u304f\u3068\u305d\u308c\u306f\u66f8\u751f\u3068\u3044\u3046\u4eba\u9593\u4e2d\u3067\u4e00\u756a\u7370\u60aa\u306a\u7a2e\u65cf\u3067\u3042\u3063\u305f\u305d\u3046\u3060\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.5679373145103455, "scores": {"\u559c\u3073": 0.0401567667722702, "\u60b2\u3057\u307f": 0.19476762413978577, "\u671f\u5f85": 0.013810195960104465, "\u9a5a\u304d": 0.5679373145103455, "\u6012\u308a": 0.010545525699853897, "\u6050\u308c": 0.17278264462947845}}, {"sentence": "\u3053\u306e\u66f8\u751f\u3068\u3044\u3046\u306e\u306f\u6642\u3005\u6211\u3005\u3092\u6355\u3048\u3066\u716e\u3066\u98df\u3046\u3068\u3044\u3046\u8a71\u3067\u3042\u308b\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.700487494468689, "scores": {"\u559c\u3073": 0.07195606827735901, "\u60b2\u3057\u307f": 0.04818345606327057, "\u671f\u5f85": 0.05010710284113884, "\u9a5a\u304d": 0.700487494468689, "\u6012\u308a": 0.03566388040781021, "\u6050\u308c": 0.09360206127166748}}],
    '草枕':[{"sentence": "\u5c71\u8def\u3092\u767b\u308a\u306a\u304c\u3089\u3001\u3053\u3046\u8003\u3048\u305f\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.8289408683776855, "scores": {"\u559c\u3073": 0.10773072391748428, "\u60b2\u3057\u307f": 0.02907346747815609, "\u671f\u5f85": 0.8289408683776855, "\u9a5a\u304d": 0.011562093161046505, "\u6012\u308a": 0.0020995228551328182, "\u6050\u308c": 0.02059338428080082}}, {"sentence": "\u667a\u306b\u50cd\u3051\u3070\u89d2\u304c\u7acb\u3064\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.9632176756858826, "scores": {"\u559c\u3073": 0.022496044635772705, "\u60b2\u3057\u307f": 0.004658727440983057, "\u671f\u5f85": 0.9632176756858826, "\u9a5a\u304d": 0.0027610203251242638, "\u6012\u308a": 0.0016421988839283586, "\u6050\u308c": 0.005224468652158976}}, {"sentence": "\u60c5\u306b\u68f9\u3055\u305b\u3070\u6d41\u3055\u308c\u308b\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.6747362017631531, "scores": {"\u559c\u3073": 0.011771629564464092, "\u60b2\u3057\u307f": 0.6747362017631531, "\u671f\u5f85": 0.03617493063211441, "\u9a5a\u304d": 0.017927387729287148, "\u6012\u308a": 0.029601342976093292, "\u6050\u308c": 0.22978855669498444}}, {"sentence": "\u610f\u5730\u3092\u901a\u305b\u3070\u7aae\u5c48\u3060\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.6526576280593872, "scores": {"\u559c\u3073": 0.0070757488720119, "\u60b2\u3057\u307f": 0.6526576280593872, "\u671f\u5f85": 0.04158525913953781, "\u9a5a\u304d": 0.01006296556442976, "\u6012\u308a": 0.007389627862721682, "\u6050\u308c": 0.28122878074645996}}, {"sentence": "\u3068\u304b\u304f\u306b\u4eba\u306e\u4e16\u306f\u4f4f\u307f\u306b\u304f\u3044\u3002", "sentiment": -1, "max_label": "\u60b2\u3057\u307f", "max_score": 0.48207804560661316, "scores": {"\u559c\u3073": 0.007235043682157993, "\u60b2\u3057\u307f": 0.48207804560661316, "\u671f\u5f85": 0.010074129328131676, "\u9a5a\u304d": 0.02322455681860447, "\u6012\u308a": 0.008531911298632622, "\u6050\u308c": 0.4688562750816345}}, {"sentence": "\u4f4f\u307f\u306b\u304f\u3055\u304c\u9ad8\u3058\u308b\u3068\u3001\u5b89\u3044\u6240\u3078\u5f15\u304d\u8d8a\u3057\u305f\u304f\u306a\u308b\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.7336082458496094, "scores": {"\u559c\u3073": 0.01126568578183651, "\u60b2\u3057\u307f": 0.1613728553056717, "\u671f\u5f85": 0.7336082458496094, "\u9a5a\u304d": 0.0041554695926606655, "\u6012\u308a": 0.006628694012761116, "\u6050\u308c": 0.08296913653612137}}, {"sentence": "\u3069\u3053\u3078\u8d8a\u3057\u3066\u3082\u4f4f\u307f\u306b\u304f\u3044\u3068\u609f\u3063\u305f\u6642\u3001\u8a69\u304c\u751f\u308c\u3066\u3001\u753b\u304c\u51fa\u6765\u308b\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.8804594278335571, "scores": {"\u559c\u3073": 0.8804594278335571, "\u60b2\u3057\u307f": 0.013572538271546364, "\u671f\u5f85": 0.06766629219055176, "\u9a5a\u304d": 0.02932816371321678, "\u6012\u308a": 0.0015129297971725464, "\u6050\u308c": 0.007460622116923332}}],
    'ポラーノの広場':[{"sentence": "\u305d\u306e\u3053\u308d\u308f\u305f\u304f\u3057\u306f\u3001\u30e2\u30ea\u30fc\u30aa\u5e02\u306e\u535a\u7269\u5c40\u306b\u52e4\u3081\u3066\u5c45\u308a\u307e\u3057\u305f\u3002", "sentiment": 0, "max_label": "\u559c\u3073", "max_score": 0.35179248452186584, "scores": {"\u559c\u3073": 0.35179248452186584, "\u60b2\u3057\u307f": 0.19183260202407837, "\u671f\u5f85": 0.16430865228176117, "\u9a5a\u304d": 0.22255419194698334, "\u6012\u308a": 0.01032960508018732, "\u6050\u308c": 0.059182461351156235}}, {"sentence": "\u5341\u516b\u7b49\u5b98\u3067\u3057\u305f\u304b\u3089\u5f79\u6240\u306e\u306a\u304b\u3067\u3082\u3001\u305a\u3046\u3063\u3068\u4e0b\u306e\u65b9\u3067\u3057\u305f\u3057\u4ff8\u7d66\u3082\u307b\u3093\u306e\u308f\u305a\u304b\u3067\u3057\u305f\u304c\u3001\u53d7\u6301\u3061\u304c\u6a19\u672c\u306e\u63a1\u96c6\u3084\u6574\u7406\u3067\u751f\u308c\u4ed8\u304d\u597d\u304d\u306a\u3053\u3068\u3067\u3057\u305f\u304b\u3089\u3001\u308f\u305f\u304f\u3057\u306f\u6bce\u65e5\u305a\u3044\u3076\u3093\u6109\u5feb\u306b\u306f\u305f\u3089\u304d\u307e\u3057\u305f\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.8454067707061768, "scores": {"\u559c\u3073": 0.8454067707061768, "\u60b2\u3057\u307f": 0.04943094402551651, "\u671f\u5f85": 0.0575052946805954, "\u9a5a\u304d": 0.032636597752571106, "\u6012\u308a": 0.0038025970570743084, "\u6050\u308c": 0.011217853054404259}}, {"sentence": "\u6b8a\u306b\u305d\u306e\u3053\u308d\u3001\u30e2\u30ea\u30fc\u30aa\u5e02\u3067\u306f\u7af6\u99ac\u5834\u3092\u690d\u7269\u5712\u306b\u62f5\u3053\u3057\u3089\u3048\u76f4\u3059\u3068\u3044\u3046\u306e\u3067\u3001\u305d\u306e\u666f\u8272\u306e\u3044\u3044\u307e\u308f\u308a\u306b\u30a2\u30ab\u30b7\u30e4\u3092\u690d\u3048\u8fbc\u3093\u3060\u5e83\u3044\u5730\u9762\u304c\u3001\u5207\u7b26\u58f2\u5834\u3084\u4fe1\u53f7\u6240\u306e\u5efa\u7269\u306e\u3064\u3044\u305f\u307e\u307e\u3001\u308f\u305f\u304f\u3057\u3069\u3082\u306e\u5f79\u6240\u306e\u65b9\u3078\u307e\u308f\u3063\u3066\u6765\u305f\u3082\u306e\u3067\u3059\u304b\u3089\u3001\u308f\u305f\u304f\u3057\u306f\u3059\u3050\u5bbf\u76f4\u3068\u3044\u3046\u540d\u524d\u3067\u6708\u8ce6\u3067\u8cb7\u3063\u305f\u5c0f\u3055\u306a\u84c4\u97f3\u5668\u3068\u4e8c\u5341\u679a\u3070\u304b\u308a\u306e\u30ec\u30b3\u30fc\u30c9\u3092\u3082\u3063\u3066\u3001\u305d\u306e\u756a\u5c0f\u5c4b\u306b\u3072\u3068\u308a\u4f4f\u3080\u3053\u3068\u306b\u306a\u308a\u307e\u3057\u305f\u3002", "sentiment": 0, "max_label": "\u9a5a\u304d", "max_score": 0.3432311713695526, "scores": {"\u559c\u3073": 0.3232460021972656, "\u60b2\u3057\u307f": 0.08329852670431137, "\u671f\u5f85": 0.1692473292350769, "\u9a5a\u304d": 0.3432311713695526, "\u6012\u308a": 0.012551771476864815, "\u6050\u308c": 0.06842519342899323}}, {"sentence": "\u308f\u305f\u304f\u3057\u306f\u305d\u3053\u306e\u99ac\u3092\u7f6e\u304f\u5834\u6240\u306b\u677f\u3067\u5c0f\u3055\u306a\u3057\u304d\u3044\u3092\u3064\u3051\u3066\u4e00\u758b\u306e\u5c71\u7f8a\u3092\u98fc\u3044\u307e\u3057\u305f\u3002", "sentiment": 0, "max_label": "\u671f\u5f85", "max_score": 0.4959408640861511, "scores": {"\u559c\u3073": 0.38896599411964417, "\u60b2\u3057\u307f": 0.04417521134018898, "\u671f\u5f85": 0.4959408640861511, "\u9a5a\u304d": 0.04369150102138519, "\u6012\u308a": 0.006504747550934553, "\u6050\u308c": 0.02072163298726082}}, {"sentence": "\u6bce\u671d\u305d\u306e\u4e73\u3092\u3057\u307c\u3063\u3066\u3064\u3081\u305f\u3044\u30d1\u30f3\u3092\u3072\u305f\u3057\u3066\u305f\u3079\u3001\u305d\u308c\u304b\u3089\u9ed2\u3044\u9769\u306e\u304b\u3070\u3093\u3078\u3059\u3053\u3057\u306e\u66f8\u985e\u3084\u96d1\u8a8c\u3092\u5165\u308c\u3001\u9774\u3082\u304d\u308c\u3044\u306b\u307f\u304c\u304d\u3001\u4e26\u6728\u306e\u30dd\u30d7\u30e9\u306e\u5f71\u6cd5\u5e2b\u3092\u5927\u80a1\u306b\u308f\u305f\u3063\u3066\u5e02\u306e\u5f79\u6240\u3078\u51fa\u3066\u884c\u304f\u306e\u3067\u3057\u305f\u3002", "sentiment": 1, "max_label": "\u559c\u3073", "max_score": 0.43016305565834045, "scores": {"\u559c\u3073": 0.43016305565834045, "\u60b2\u3057\u307f": 0.11178276687860489, "\u671f\u5f85": 0.19776010513305664, "\u9a5a\u304d": 0.1652033030986786, "\u6012\u308a": 0.023364605382084846, "\u6050\u308c": 0.07172621786594391}}, {"sentence": "\u3042\u306e\u30a4\u30fc\u30cf\u30c8\u30fc\u30f4\u30a9\u306e\u3059\u304d\u3068\u304a\u3063\u305f\u98a8\u3001\u590f\u3067\u3082\u5e95\u306b\u51b7\u305f\u3055\u3092\u3082\u3064\u9752\u3044\u305d\u3089\u3001\u3046\u3064\u304f\u3057\u3044\u68ee\u3067\u98fe\u3089\u308c\u305f\u30e2\u30ea\u30fc\u30aa\u5e02\u3001\u90ca\u5916\u306e\u304e\u3089\u304e\u3089\u3072\u304b\u308b\u8349\u306e\u6ce2\u3002", "sentiment": 0, "max_label": "\u559c\u3073", "max_score": 0.6428514122962952, "scores": {"\u559c\u3073": 0.6428514122962952, "\u60b2\u3057\u307f": 0.06923378258943558, "\u671f\u5f85": 0.05565986409783363, "\u9a5a\u304d": 0.17509391903877258, "\u6012\u308a": 0.005316506139934063, "\u6050\u308c": 0.05184461176395416}}]
    }
    st.session_state.api_result = sampletext_dict[selected_item]
    
    # スライダーの変数を初期化
    row_number = 0


st.sidebar.caption("学習元データセット　WRIME: 主観と客観の感情強度を付与した日本語データセット（梶原 智之）")

# APIの結果を表示
if st.session_state.api_result:
    df = to_dataframe(st.session_state.api_result)
    
    #streamlitで表示
    st.header('分析結果')
    
    # ポジティブ度・アクティブ度の作成
    def ActiveSentiment(sentiment):
        list_size = len(sentiment)
        # 最大値(+2)と最小値(-2)を均等に分配
        # 要素数が奇数の場合、中央の値を0に設定（平均値に近づけるため）
        if list_size % 2 == 0:
            # 偶数の場合、半分を最小値、半分を最大値にする
            scores = [-2] * (list_size // 2) + [2] * (list_size // 2)
        else:
            # 奇数の場合、最小値と最大値の間に1つ0を挿入
            scores = [-2] * (list_size // 2) + [0] + [2] * (list_size // 2)
        return np.std(sentiment)/np.std(scores)
    
    mentality = df['normalized_scores'].mean()
    tension = ActiveSentiment(df['sentiment'])
    
    def to_determine(x):
        if isinstance(x, float):
            return int(np.floor((x*10,0))[0])
        return x
    
    st.write("全体のポジティブ度：" + "{:.1f}%".format(mentality *100))
    st.info(mentality_descriptions.get(to_determine(mentality)))
    st.write("全体のテンション：" + "{:.1f}%".format(tension *100))
    st.info(tension_descriptions.get(to_determine(tension)))
    
    # 罫線
    st.divider()
    
    st.markdown('**感情折れ線チャート**')
    st.caption('色つきの●は感情の種類・大きさを表します。マウスホバーで詳細表示')
    
    # 感情折れ線チャートの作成
    fig = go.Figure()
    
    # カラースケールを定義
    color_scale = 'Viridis'
    
    # x軸ラベルの作成
    def create_label(row):
        x_label = str(row.name) + "　" + row['sentence'][:8]
        if len(row['sentence']) > 8:
            x_label = x_label + "…"
        return x_label
    sentence_label = df.apply(create_label, axis=1)
    
    # 折れ線チャートの追加
    fig.add_trace(go.Scatter(
        x=sentence_label, 
        y=df['sentiment'],
        mode='lines',
        line=dict(color='black'),
        showlegend=False
    ))
    
    # 分散図のホバーテキストの生成
    hover_texts = df.apply(lambda row: 
        f"{row['sentence'][:50]}<br>" +
        f"感情: {row['max_label']}" +
        {"喜び": "😄", "期待": "🙂", "驚き": "😲", "恐れ": "😨", "悲しみ": "😢", "怒り": "😠"}.get(row['max_label'], "") +
        "　" +
        f"大きさ: {round(row['max_score']*100,1)}%<br>",
        axis=1
    ).tolist()
    
    # 散布図の追加
    fig.add_trace(go.Scatter(
        x=sentence_label, y=df['sentiment'], 
        mode='markers',
        marker=dict(
            size=df['max_score']*30, 
            color=df['normalized_scores'],
            showscale=True,
            coloraxis='coloraxis',  # カラーアクシスの参照を追加
            ),
        text=hover_texts,  # ホバーテキストを設定
        hoverinfo='text'  # テキストを表示
    ))
    
    # レイアウトの設定
    fig.update_layout(
        xaxis_title='文章',
        xaxis=dict(
            tickangle=90
            ),
        yaxis_title='テンション',
        yaxis=dict(
            range=(-3, 3)
            ),
        coloraxis=dict(colorscale=getattr(px.colors.sequential, color_scale)),
        showlegend=False,
        height=600,
        annotations=[
            dict(
                xref='paper',
                yref='paper',
                x=1.1,  # カラーバーの直ぐ隣を指す
                y=1,  # カラーバーの上部
                text="Positive",
                showarrow=False,
                align="left"
            ),
            dict(
                xref='paper',
                yref='paper',
                x=1.1,  # カラーバーの直ぐ隣を指す
                y=0.15,  # カラーバーの下部
                text="Negative",
                showarrow=False,
                align="left"
            )
        ]
    )
    
    # 感情折れ線チャートを表示
    st.plotly_chart(fig)

    # スライダー＆ヒストグラムを表示
    st.markdown('**文章ごとの感情**')
    st.caption('スライダーで各行の感情の分布を確認できます')
    
    row_number = st.slider(
        "文章ごとの感情", 
        min_value=1, 
        max_value=len(df[emotion_list]), 
        value=1,
        format="%d行目",
        label_visibility='hidden'
        )
    st.write(df['sentence'][row_number])

    selected_row = df[emotion_list].T[row_number]
    
    barfig = px.bar(
        selected_row,
        labels=dict(index=df['sentence'][row_number],value='感情の大きさ'),
        range_y=[0.0,1.0],
        color=[6,5,4,3,2,1],
        color_continuous_scale=color_scale,
        )
    st.plotly_chart(barfig)
    
    # 罫線
    st.divider()
    
    #  カラムの比率を指定
    col1, col2 = st.columns((2,1))
    
    with col1:
        # 列ごとの平均値を計算
        emo_df_mean = df[emotion_list].mean().reset_index()
        emo_df_mean.columns = ['感情', '大きさ']
        
        # 円グラフを作成
        piefig = px.pie(emo_df_mean, names='感情', values='大きさ',title='感情の割合',
                        color='感情',
                        color_discrete_map={
                            "喜び": "#fde725",
                            "期待": "#b5de2b", 
                            "驚き": "#35b779", 
                            "恐れ": "#26828e", 
                            "悲しみ": "#3e4989", 
                            "怒り": "#440154"},
                        width=400
                        )
        st.plotly_chart(piefig)
    
    with col2:
        st.markdown('<br><br>', unsafe_allow_html=True)
        
        # max_labelの各値の出現回数を計算
        label_counts = df['max_label'].value_counts()
        # 最頻値を取得
        mode_labels = df['max_label'].mode()
        
        mode_df = pd.DataFrame({
            '最大感情': [df.loc[df['max_score'] == df['max_score'].max(), 'max_label'].iloc[0]],
            '感情の大きさ':["{:.1f}%".format(df['max_score'].max()*100)],
            '最頻感情': ['、'.join(mode_labels.tolist())],
            '最頻感情の登場数':label_counts.iloc[0],
        })
        st.dataframe(mode_df.T)
    
    
    #出力用データテーブルの作成
    st.subheader('分析データをダウンロード')
    st.markdown('**データ詳細**')
    
    st_df = df.copy()
    st_df.rename(
        columns={
            'sentence': '文章',
            'sentiment': 'テンション',
            'max_label': '最大感情',
            'max_score': '最大感情の大きさ',
            'normalized_scores': 'ポジティブ度'
            },
        inplace=True
        )
    
    # データフレームをCSV形式→バイト形式に変換
    csv = st_df.to_csv(index=False)
    to_write = StringIO(csv)
    st.dataframe(st_df)
    
    # ダウンロードボタンを作成
    st.download_button(
        label="CSV形式ファイルをダウンロード",
        data=to_write.getvalue(),
        file_name='emotion_data.csv',
        mime='text/csv',
    )